chemary/nrf52_ble_long_range/peripheral_long_range_demo_kit/main.c
    err_code = sd_ble_gap_ppcp_set(&m_conn_param);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT library. */

/**@brief Function for initializing power management.
 */
static void power_management_init(void) {
    ret_code_t ret;
    ret = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(ret);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details Handle any pending operation(s), then sleep until the next event occurs.
 */
static void idle_state_handle(void) {
    if (NRF_LOG_PROCESS() == false) {
        nrf_pwr_mgmt_run();
    }
}

/**@brief Function for setting new output power selection: LEDs start to blink according to the selected state.
 * Note: this function sets the output power/TX power.
 *       The new output power will be set when (re-)starting to scan.
 */
static void output_power_selection_set(output_power_seclection_t output_power) {
    ret_code_t err_code;
    m_output_power_selected = output_power;
    switch (m_output_power_selected) {
        case SELECTION_8_dBm:
            // 8 dBm is the current output power, start blinking LED.
            bsp_board_led_off(OUTPUT_POWER_SELECTION_LED); // not necessary because the LED should start to blink.
            err_code = app_timer_start(m_8dBm_led_slow_blink_timer_id, SLOW_BLINK_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            break;
        case SELECTION_0_dBm:
            // 0 dBm is the current output power, turn on LED.
            err_code = app_timer_stop(m_8dBm_led_slow_blink_timer_id);
            APP_ERROR_CHECK(err_code);
            bsp_board_led_on(OUTPUT_POWER_SELECTION_LED);
            break;
    }
}

/**@brief Function for switching output power/TX power: 0 dBm or 8 dBm.
 * Note:  this function does only set the internal state, it does apply the new setting.
 *        The new output power will be set when (re-)starting to scan.
 */
static void on_output_power_selection_button(void) {
    // Change the output power.
    output_power_seclection_t new_output_power;
    switch (m_output_power_selected) {
        case SELECTION_0_dBm: // 0 dBm is the previous output power.
            // 8 dBm is the current output power, start blinking LED.
            new_output_power = SELECTION_8_dBm;
            break;
        case SELECTION_8_dBm:
            // 0 dBm is the current output power, turn on LED.
            new_output_power = SELECTION_0_dBm;
            break;
    }
    output_power_selection_set(new_output_power);
}

/**@brief Function for setting new phy selection. LEDs start to blink according to the selected state.
 * Note: this function does only set the internal state, it does apply the new setting.
 *       The new phy will be be used when (re-)starting scanning.
 */
static void phy_selection_set_state(adv_scan_phy_seclection_t new_phy_selection) {
    ret_code_t err_code;
    m_adv_scan_phy_selected = new_phy_selection;

    switch (new_phy_selection) {
        case SELECTION_1M_PHY: // SELECTION_1M_PHY is the current "state".
            // 1 Mbps is the current state, LED should start blinking.
            err_code = app_timer_start(m_1Mbps_led_slow_blink_timer_id, SLOW_BLINK_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            break;
        case SELECTION_CODED_PHY:
            // Coded phy is the current sate, turn on LED.
            err_code = app_timer_stop(m_1Mbps_led_slow_blink_timer_id);
            APP_ERROR_CHECK(err_code);
            bsp_board_led_on(PHY_SELECTION_LED);
            break;
    }
}

/**@brief Function for switching PHY: coded phy or 1 Mbps
 * Note: this function does only set the internal state, it does apply the new setting.
 *       The new phy will be be used when (re-)starting scanning.
 */
static void on_phy_selection_button(void) {
    // Change the selected phy.
    adv_scan_phy_seclection_t new_phy_selection;
    switch (m_adv_scan_phy_selected) {
        case SELECTION_CODED_PHY: // SELECTION_CODED_PHY is the previous "state".{
            // 1 Mbps is the current state, LED should start blinking.
            new_phy_selection = SELECTION_1M_PHY;
            break;
        case SELECTION_1M_PHY:
            // Coded phy is the current sate, turn on LED.
            new_phy_selection = SELECTION_CODED_PHY;
            break;
    }
    phy_selection_set_state(new_phy_selection);
}

/**@brief Function setting the internal advertising state.
 * Note: this function does only set the internal "advertising state", it does not start advertising.
 *       The new advertising mode will be used when (re-)starting to advertise.
 */
static void on_non_conn_or_conn_adv_selection_state_set(adv_scan_type_seclection_t adv_selection) {
    ret_code_t err_code;

    m_adv_scan_type_selected = adv_selection;
    bsp_board_led_off(CONN_ADV_CONN_STATE_LED);
    switch (adv_selection) {
        case SELECTION_NON_CONNECTABLE:
            // Current state is non-connectable advertising. Start blinking associated LED.
            err_code = app_timer_stop(m_conn_adv_fast_blink_timer_id);
            APP_ERROR_CHECK(err_code);
            bsp_board_led_off(CONN_ADV_CONN_STATE_LED);

            err_code = app_timer_start(m_non_conn_fast_blink_timer_id, FAST_BLINK_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            break;
        case SELECTION_CONNECTABLE: 
            // Current state is connectable advertising. Start blinking associated LED.
            err_code = app_timer_stop(m_non_conn_fast_blink_timer_id);
            APP_ERROR_CHECK(err_code);
            bsp_board_led_off(NON_CONN_ADV_LED);

            err_code = app_timer_start(m_conn_adv_fast_blink_timer_id, FAST_BLINK_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            break;
    }
}

/**@brief Function for switching between "non-connectable and connectable advertising" selection.
 * Note: this function does only set the internal "advertising state", it does not start advertising.
 *       The new advertising mode will be used when (re-)starting to advertise.
 */
static void on_non_conn_or_conn_adv_selection(void) {
    // Change the advertising type
    adv_scan_type_seclection_t new_adv_selection;

    switch (m_adv_scan_type_selected) {
        case SELECTION_CONNECTABLE: // Connectable advertising is the previous state.
            // Current state is non-connectable advertising. Start blinking associated LED.
            new_adv_selection = SELECTION_NON_CONNECTABLE;
            break;
        case SELECTION_NON_CONNECTABLE:
            // Current state is connectable advertising. Start blinking associated LED.
            new_adv_selection = SELECTION_CONNECTABLE;
            break;
    }
    on_non_conn_or_conn_adv_selection_state_set(new_adv_selection);
}

/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
void bsp_evt_handler(bsp_event_t event) {
    ret_code_t err_code;

    if (event != BUTTON_NOT_IN_USE_EVENT) {
        // Set the correct parameters, depending on the button pushed.
        switch (event) {
            case PHY_SELECTION_BUTTON_EVENT:
                on_phy_selection_button();
                break;
            case OUTPUT_POWER_SELECTION_BUTTON_EVENT:
                on_output_power_selection_button();
                break;
            case NON_CONN_OR_CONN_ADV_BUTTON_EVENT:
                on_non_conn_or_conn_adv_selection();
                break;
            default:
                break;
        }

        disconnect_stop_adv();
        advertising_data_set();
        advertising_start();
    }
}

/**@brief Function for initializing buttons and leds.
 */
static void buttons_leds_init(void) {
    ret_code_t err_code;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_evt_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising with the current selections of output power, phy, and connectable or non-connectable advertising.
 */
static void set_current_adv_params_and_start_advertising(void) {

    phy_selection_set_state(m_adv_scan_phy_selected);
    on_non_conn_or_conn_adv_selection_state_set(m_adv_scan_type_selected);
    output_power_selection_set(m_output_power_selected);

    advertising_data_set();
    advertising_start();
}

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advdata_update(void) {
    ret_code_t ret;

    increase_adv_cnt();
    // update_time();
    update_adv_cnt();
    update_temp();
    update_vbatt();

    ble_advdata_service_data_t service_data[4];

    service_data[0].service_uuid =  BLE_UUID_BATTERY_SERVICE;
    service_data[0].data.size = sizeof(vbatt);
    service_data[0].data.p_data = (uint8_t *)&vbatt;

    service_data[1].service_uuid = BLE_UUID_HEALTH_THERMOMETER_SERVICE;
    service_data[1].data.size = sizeof(temp);
    service_data[1].data.p_data = (uint8_t *)&temp;

    service_data[2].service_uuid = 0x1801; // 0x2700 unitless
    service_data[2].data.size = sizeof(adv_cnt);
    service_data[2].data.p_data = (uint8_t *)&adv_cnt;

    service_data[3].service_uuid = 0x2703; // time (second) // 0x1847 Device Time
    service_data[3].data.size = sizeof(sec_cnt);
    service_data[3].data.p_data = (uint8_t *)&sec_cnt;

    ble_gap_adv_params_t adv_params = {
        .properties = {
            .type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED,
        },
        .p_peer_addr = NULL,
        .filter_policy = BLE_GAP_ADV_FP_ANY,
        .interval = ADV_INTERVAL,
        .duration = 0,

        .primary_phy = BLE_GAP_PHY_1MBPS, // Must be changed to connect in long range. (BLE_GAP_PHY_CODED)
        .secondary_phy = BLE_GAP_PHY_1MBPS,
        .scan_req_notification = 1,
    };

    ble_advdata_t const adv_data = {
        .name_type = BLE_ADVDATA_FULL_NAME,
        .flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE,
        .include_appearance = false,
        .service_data_count = 3,
        .p_service_data_array = service_data
    };

    m_adv_data.adv_data.len = BLE_GAP_ADV_SET_DATA_SIZE_MAX;

    // only extended advertising will allow primary phy to be coded
    adv_params.primary_phy = BLE_GAP_PHY_CODED;
    adv_params.secondary_phy = BLE_GAP_PHY_CODED;

    adv_params.properties.type = BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED;

    ret = ble_advdata_encode(&adv_data, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(ret);

    ret = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &adv_params);
    APP_ERROR_CHECK(ret);
}

/**@brief Function for updating the VBATT field of TLM*/
static void update_vbatt(void) {
    uint16_t vbatt_tmp;              // Variable to hold voltage reading
    battery_voltage_get(&vbatt_tmp); // Get new battery voltage

