chemary/nrf52_ble_long_range/peripheral_long_range_demo_kit/main.c
    NRF_LOG_INFO("Voltage: %d", vbatt_tmp);
    vbatt[0] = (uint8_t)(vbatt_tmp/100); // 1V = 10
    //vbatt[0] = (uint8_t)(vbatt_tmp >> 8);
    //vbatt[1] = (uint8_t)vbatt_tmp;
}

/**@brief Function for updating the TEMP field of TLM*/
static void update_temp(void)
{
    int32_t temperature;                                        // variable to hold temp reading
    (void)sd_temp_get(&temperature);                            // get new temperature
    NRF_LOG_INFO("Temperature: %d", temperature);
    int16_t temp_new = (int16_t) temperature;                   // convert from int32_t to int16_t
    //temp[0] = (uint8_t)((temp_new >> 2) & 0xFFUL); // Right-shift by two to remove decimal part
    //temp[1] = (uint8_t)((temp_new << 6) & 0xFFUL); // Left-shift 6 to get fractional part with 0.25 degrees C resolution

    temp_new = temp_new * 25; // temp in 10bits converted to 0.01C units (100*t/4) 
    temp[1] = (uint8_t)(temp_new >> 8);
    temp[0] = (uint8_t)temp_new;
}

/**@brief Function for updating the ADV_SEC field of TLM*/
static void update_time(void)
{
    static uint32_t time_total_100_ms = 0;
    uint32_t        be_time_100_ms; // Big endian version of 0.1 second counter.

    time_total_100_ms += es_stopwatch_check(m_time_sec_sw_id);

    be_time_100_ms = BYTES_REVERSE_32BIT(time_total_100_ms);

    memcpy(sec_cnt, &be_time_100_ms, 4);
}

static void increase_adv_cnt(void)
{
    m_le_adv_cnt++;
}

static void update_adv_cnt(void)
{
    uint32_t be_adv_cnt = BYTES_REVERSE_32BIT(m_le_adv_cnt);
    memcpy(adv_cnt, (uint8_t *)(&be_adv_cnt), 4);
}


static void update_vbatt_init(void) {
    uint32_t err_code;
    err_code = app_timer_start(m_battery_timer_id, UPDATE_ADV_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    // es_stopwatch_init();
}

int main(void) {
    // Initialize.
    log_init();

    timers_init();
    buttons_leds_init();

    power_management_init();
    ble_stack_init();
    gap_params_init();
    battery_voltage_init();

    // Start execution.
    NRF_LOG_INFO("Long range Tile started");
    set_current_adv_params_and_start_advertising();
    update_vbatt_init();

    // Enter main loop.
    for (;;) {
        idle_state_handle();
    }
}

/**
 * @}
 */